Задание 1
Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные:  
[1, 1, 1, 2, 2, 3, 3],
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
[450, 300, 350, 500, 450, 370, 290].

In [1]:
import pandas as pd

In [5]:
authors = pd.DataFrame({'author_id' : [1,2,3], 'author_name' : ['Turgenev', 'Chehov', 'Ostrovsky']})

In [7]:
books = pd.DataFrame({'author_id' : [1,1,1,2,2,3,3], 'book_title' : ['Fathers and sons', 'Rudin', 'Noble nest', 'Fat and lean', 'Dame with the dog', 'Storm', 'Talents and fans'], 'price' : [450, 300, 350, 500, 450, 370, 290]})

In [8]:
authors

   author_id author_name
0          1    Turgenev
1          2      Chehov
2          3   Ostrovsky

In [9]:
books

   author_id         book_title  price
0          1   Fathers and sons    450
1          1              Rudin    300
2          1         Noble nest    350
3          2       Fat and lean    500
4          2  Dame with the dog    450
5          3              Storm    370
6          3   Talents and fans    290

Задание 2
Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [13]:
authors_price = pd.merge(authors, books, on='author_id', how='left')

In [14]:
authors_price

   author_id author_name         book_title  price
0          1    Turgenev   Fathers and sons    450
1          1    Turgenev              Rudin    300
2          1    Turgenev         Noble nest    350
3          2      Chehov       Fat and lean    500
4          2      Chehov  Dame with the dog    450
5          3   Ostrovsky              Storm    370
6          3   Ostrovsky   Talents and fans    290

Задание 3
Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [22]:
top5 = authors_price.nlargest(5, 'price')

In [23]:
top5

   author_id author_name         book_title  price
3          2      Chehov       Fat and lean    500
0          1    Turgenev   Fathers and sons    450
4          2      Chehov  Dame with the dog    450
5          3   Ostrovsky              Storm    370
2          1    Turgenev         Noble nest    350

Задание 4
Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора,минимальная, максимальная и средняя цена на книги этого автора .

In [61]:
df_min = authors_price.groupby('author_name').agg({'price':'min'}).rename(columns={'price':'min_price'})

In [62]:
df_max = authors_price.groupby('author_name').agg({'price':'max'}).rename(columns={'price':'max_price'})
df_av = authors_price.groupby('author_name').agg({'price':'mean'}).rename(columns={'price':'mean_price'})

In [63]:
authors_stat=pd.concat([df_min, df_max, df_av], axis = 1)

In [64]:
authors_stat

             min_price  max_price  mean_price
author_name
Chehov             450        500  475.000000
Ostrovsky          290        370  330.000000
Turgenev           300        450  366.666667